{
    "lessons": [
      {
        "lines": [
          "SPEECH AND THEATER ARTS",
          "",
          "Introduction to Speech Communication",
          "",
          "By the end of the lesson, the students will have been",
          "able to:",
          "",
          "a. explain the theories of speech communication;",
          "b. obtain insight into the nature of speech communication;",
          "c. appreciate the functions of speech communication in",
          "",
          "everyday life; and",
          "",
          "d. recognize the importance of speech communication."
        ]
      },
      {
        "lines": [
            "Starter",
            "",
            "a. Form groups of four to five members.",
            "b. Define speech communication.",
            "c. Think   of   a   communication   situation   to   expound   your   definition   of",
            "communication. This will be presented to the class for two minutes.",  
            "d. Be creative.",
            "e. You have five minutes to prepare."
        ]
      },
      {
        "lines": [
            "Discussion",
            "",
            "Introduction to Speech Communication",
            "",
            "Relationship of Speech, Language and Communication",
            "",
            "Speech, language and communication play a vital role in our lives. Without",
            "being able to talk and understand other people we can’t do things like:",
            "",
            "- Communicate with our families",
            "- Buy things at the shops",
            "- Watch television",
            "- Build relationships",
            "- Socialise",
            "- Learn",
            "- Go to work"
        ],
        "image": "assets/spiderman.png"
      },
      {
        "lines": [
            "",
            "Fortunately,   most   people   learn   to   communicate. People   develop",
        "communication   skills   from   birth.   They   rely   on   speech,   language   and",
            "communication   to   be   able   to   learn   at   school   and   play   with   their   friends.",
            "Specifically, they learn to understand words, sentences, and conversations which",
            "is often  called  ‘receptive  language’. They also learn how  to talk using  words",
            "and sentences which is often called ‘expressive language’. They know how to",
            "use their language socially. For example, listening as well as talking, or talking to",
            "a teacher differently than to a friend. This is often called ‘pragmatic language’.",
            "Also, they say speech sounds correctly so they can be understood by others."
        ]
      },
      {
        "lines": [
            "",
            "People begin to understand words before they can say them. They then",
            "learn how to say these words and how to put them together to make sentences.",
            "They   develop   speech,   language   and   communication   skills   at   different   rates.",
            "Some   develop   quickly,   while   others   do   not.   Speech,   language   and",
            "communication all sound the same, but they actually have unique meanings."
        ]
      },
      {
        "lines": [
            "",
            "Speech generally refers to the action of producing speech or the act of",
            "speaking.   Someone   with   a   speech   challenge   may   have   trouble   with   specific",
            "sounds, patterns of words, or intelligibility. Types of speech challenges include",
            "articulation disorders or phonological disorders."
        ]
      },
      {
        "lines": [
            "",
            "Language refers   to   the   ability   to   communicate   through   speech   by",
            "delivering   and   receiving   meaningful   messages.  Correct   language  may  include",
            "delivering or deciphering the message through reading or hearing. A child with",
            "language challenges may not use proper sentence construction and grammar",
            "(eg “I goed to the park) or may have trouble deciphering complex sentences or",
            "thoughts. The ability to express oneself is called expressive language ability. The",
            "ability to decipher and understand language is called receptive language ability."
        ]
      },
      {
        "lines": [
            "",
            "Communication is   the   broadest   category   of   them   all.   Communication",
        "includes spoken language but also includes many other non-verbal cues which",
        "are essential for interacting and communicating with others. It is common that",
        "even if child or adult has proper speech and language, he/she may still struggle",
        "with   communication.  This   could   take   the   form   of   not   understanding   sarcasm,",
        "gestures, or facial expressions which are also cues as to the meaning of what",
        "someone   is   trying   to   communicate   to   them.   Children   with   autism   spectrum",
        "disorders (ASD) often exhibit these characteristics."
        ]
      },
      {
        "lines": [
            "",
            "Speech  and  language  are   the   most   prominent   cognitive   functions",
        "distinguishing human beings from animals. The major medium of communication",
        "in a day-to-day experience is speech. Man is the only talkative creature on the",
        "face of the earth; he/she is the only created being that can communicate his/her",
        "thoughts, feelings, desires and ideas by means of speech. He/she communicates",
        "these through the use of intelligible words. If one hopes to exist in a society or to",
        "get what he needs for progress and prosperity, he/she needs to communicate",
        "effectively.   Speech   is   the   tool   that   leads   to   mutual   understanding   and",
        "appreciation;   hence,   it   is   important   to   employ   and   develop   these   God-given",
        "faculties."
        ]
      },
      {
        "lines": [
            "",
            "Speech   communication  involves   the   production   and   perception   of",
            "sounds   used   in   spoken   language.   It   is   also   called  oral   communication.",
            "Generally, it refers to the process of transmitting mental intentions and meaning",
            "through   symbols   encoded   through   structurally   repeated   human   sounds.   This",
            "process is produced by the working together of certain human linguistic abilities",
            "such   as   that   of   being   able   to   distinguish   speech   sounds,   to   produce   the",
            "distinction among speech sounds and to express as well as construct meanings",
            "through them. It also seeks to understand how human listeners recognize speech",
            "sounds   and   to   use   this   information   to   understand   oral   language.   Likewise,   it",
            "conveys perspectival information as it focuses mostly in linguistics (articulatory",
            "phonetics ad phonology), paralinguistic, expressive (attitudes and emotions), and",
            "organic (reflecting the speaker’s ages, sex, etc.) aspects."
        ]
      },
      {
        "lines": [
            "",
            "Speech or Oral communication is a two-way process as it provides a clear",
            "insight about the meaning to the message, and the message transmitted and the",
            "feedback   is   immediate.   We   communicate   orally   with   our   family,   friends,   in",
            "meetings, committees, conferences, over the telephone, radio, public, etc."
        ]
      },
      {
        "lines": [
            "",
            "Oral communication describes any type of interaction that makes use of",
            "spoken words. It  implies communication  through  mouth.  It includes individuals",
            "conversing with each other, be it direct conversation or telephonic conversation."
        ]
      },
      {
        "lines": [
            "",
            "Oral communication may be internal (within the organization) or external",
            "(outside   the   organization).  The   types   of   oral   communication   commonly   used",
            "within   an   organization   include   staff   meetings,   personal   discussions,",
            "presentations, telephone discourse, and informal conversation. On the one hand,",
            "oral communication with those outside of the organization might take the form of",
            "face-to-face   meetings,   telephone   calls,   speeches,   teleconferences,   or",
            "videoconferences."
        ]
      },
      {
        "lines": [
             "Theories of Speech Communication",
            "",
            "Some   scientists   formulated   theories   pertaining   to   language   origin.  This",
            "was   to   satisfy   man’s   curiosity   over   the   true   origin   of   language   and",
            "communication.   Below   are   the   oldest   and   most   common   theories   of   how",
            "language began."
        ]
      },
      {
        "lines": [
            "Bob-wow Theory",
            "",
            "This theory states that language is a product of man’s mimicking of the",
            "sounds of nature. For example, when water moves, one  hears a splash  or a",
            "slosh. Animal sounds form part of the English dictionary; among them are croak",
            "(frogs),   cackle   (hens),   crow   (roosters),   growl   (tigers),   tweet   (birds)   and   oink",
            "(pigs)."
        ]
      },
      {
        "lines": [
            "Ding-dong Theory",
        "",
        "Similar   to   the   bow-wow   theory,   the   ding-dong   theory   attributes   the",
        "development of a language to man’s imitative nature. However, human beings",
        "did not imitate only sounds coming from nature. They also imitated the sounds",
        "emanating from those things they themselves produced. For example, the sound",
        "of a train (toot), a clock (tick or tic-tac), a horn (honk), a gun (bang), an explosive",
        "device (boom) and a metallic object (ting) form part of the English vocabulary."
        ]
      },
      {
        "lines": [
            "Yo-he-ho Theory",
            "",
            "This theory states that a language is a product of man’s physical activities.",
            "Human beings utter words as they exert effort in accomplishing their physical",
            "tasks. For example, when an individual smells what he is cooking, he expresses",
            "“Hmmmm!” When a martial arts expert performs a karate move, he says “Hayk!”",
            "When a woman gives birth a newborn, she cries “Oooh!,” and when someone",
            "gets too tired in a marathon race, he murmurs “Ah!”"
        ]
      },
      {
        "lines": [
            "Ta-ta theory",
            "",
            "Allied to the yo-he-ho theory, the ta-ta theory attributes man’s language to",
            "some   physical   acts   of   men,   particularly   their   hand   gestures.   It   states   that",
            "language is produced out of their ability to form words based on the movements",
            "of their hands. For example, the term “ta-ta,” a French word meaning “goodbye,”",
            "is created by letting the tongue move up and down in much the same way as the",
            "hand moves as a person waves goodbye."
        ]
      },
      {
        "lines": [
            "Ta-ra-ra-boom-de-ay Theory",
        "",
        "According to this theory, rituals of primitive men were responsible for the",
        "birth of languages. Rituals were an indispensable part of their lives. During these",
        "rituals,  there  were  dancing,  singing  or chanting  and  shouting. The words that",
        "came out of their mouths as they chanted and shouted later became expressions",
        "in their respective languages."
        ]
      } ,
      {
        "lines": [
            "Nature of Speech Communication",
            "",
            "1. Speech Communication is a whole process.",
            "",
            "2. Speech Communication is inevitable and irreversible.",
            "",
            "3. Speech Communication involves content and relationship.",
            "",
            "4. Speech Communication is purposive.",
            "",
            "5. Speech Communication involves interaction.",
            "",
            "6. Speech Communication is transitory.",
            "",
            "7. Speech Communication occurs in specific settings.",
            "",
            "8. Speech Communication is influenced by the fields of experience of the",
            "speaker.",
            "",
            "9. Speech Communication does not contain the usual cues of writing."
        ]
      },
      {
        "lines": [
            "Functions of Speech Communication",
        "",
        "Considering how much talking you do and the variety of ways speech is",
        "used in your daily lives, it is surprising how little attention most of you give to the",
        "way in which you speak. You speak so much and so often that you simply accept",
        "the fact that you can speak and rarely stop to think about how, why and when",
        "you do it. You will improve your speech communication competence if you will",
        "understand how the process works. This will help reduce your speech difficulties",
        "and  will  reduce  if  not  totally  eliminate  communication   breakdowns.  Below   are",
        "some of the functions of speech communication"
        ]
      }  ,
      {
        "lines": [
            "1. Speech Communication connects one person with another.",
            "",
            "You are not limited in any way to talk with the person next to you only",
            "but you also talk to others who are miles and million miles away. This may",
            "come possible with the use of the appropriate instruments. Because of this,",
            "there is the great possibility that you, as a speaker may leave a major share",
            "of   yourself   and   your   thoughts   and   beliefs   to   the   many   people   you   are",
            "communicating with."
        ]
      }  ,
      {
        "lines": [
            "2. Speech Communication develops high mental processes.",
            "",
            "Nothing beats the difficult nature of this task. You need to consult your",
            "mind on what to say with the effort to make it coherent and in line with what is",
            "being   talked   about.   This   is   a   good   mental   experience   when   you   are   to",
            "scrutinize the deepest recesses of your working brain in search of what to say",
            "next.   Have   you   come   across   a   person   who   wants   so   much   of   your   time",
            "waiting for him to  say the next things he  wants to  say?  Or have you  met",
            "someone who talks words, words and many words only to end up with no",
            "sense at all? At least, you would know whom to talk with next time."
        ]
      }  ,
      {
        "lines": [
            "3. Speech Communication regulates speech itself.",
            "",
            "You   are   supposed   to   know   when   to   begin   and   when   to   end   your",
            "speech. You should also know what to talk about to a particular person or",
            "group. You are gifted with the freedom to speak, but with this, is your duty and",
            "obligation to be selective and be appropriate with the speech communication",
            "situation you are in. There are always limits set to signal you with reference to",
            "the sphere your speech activity has occupied. With this, you can monitor the",
            "flow of the communication process."
        ]
      },
      {
        "lines": [
            "4. Speech Communication serves as an important factor in the preservation",
            "of one’s heritage.",
            "",
            "Among the elements of God’s creation, you are the only one gifted with",
            "the capacity to talk. You are the only one endowed with the ability to word out",
            "your ideas and feelings. The idea that a culture speaks this way and the other",
            "speaks in another way is enough proof that speech communication furthers",
            "the cultural identity of a group of people. Speech communication marks your",
            "identity as a person who belongs to a particular culture."
        ]
      }  ,
      {
        "lines": [
            "",
            "The aforementioned functions of speech communication are surprisingly",
            "broad, such that any student of communication would be surprised that he/she",
            "had been taking the subject for granted. There are five major functions of speech",
            "communication.   These   are   control,   social   interaction,   motivation,   emotional",
            "expression, and information dissemination.",
            "",
            "1. Control – Communication functions to control behavior.",
            "",
            "2. Social Interaction – Communication allows individuals to interact with others.",
            "",
            "3. Motivation – Communication motivates or encourages people to live better.",
            "",
            "4. Emotional expression – Communication facilitates people’s expression of their",
            "feelings and emotions.",
            "",
            "5. Information dissemination – Communication functions to convey information."
        ]
      }      ,
      {
        "lines": [
            "Importance of Speech Communication in the Workplace",
        "",
        "1.   Company:  The   worker   especially   needs   to   have   well-defined   form   of",
        "communication   skills   to   convey   a   message   effectively.   Without   this   type   of",
        "communication, an employee  can  neither speak to  his superiors properly, nor",
        "would he be able to speak to his juniors, thus giving rise to miscommunications.",
        "This might even effect the productivity of the company."
        ]
      }   ,
      {
        "lines": [
            "",
            "2. Customer service: In customer service, an employee is expected to listen to",
            "the   customer   queries   and   answer   the   customer   accordingly,   ina   convincing",
            "manner. If an employee lacks communication skills, then the company might lose",
            "the customer."
        ]
      } ,
      {
        "lines": [
            "",
            "3.  Technical   field:   Sometimes,   technical   knowledge   must   be   translated   into",
        "layman's terms in a company. This is only possible when the person has good",
        "oral   communication   skills.   For   instance,   if   a   company   wants   to   buy   a   new",
        "product,   or   if   a   company   makes   a   new   product,   then   it   has   to   convey   the",
        "message   about   the   product   to   the   salesmen.   The   salesmen   may   not   be",
        "interested in the working of the product; instead, they are keener in the benefits",
        "that the product is expected to give. In such a case, the engineers are expected",
        "to have good oral communication skills so that they deliver the right message",
        "from the layman point of view to the salesmen, without getting into too many",
        "technical details."
        ]
      }   ,
      {
        "lines": [
            "",
            "4. Communicating ideas: A person might have an idea. But if he is not able to",
            "express the ideas effectively to his colleagues or other people, then that idea",
            "becomes useless."
        ]
      }   
             
    ]
  }
  